
## Plan Result (sandbox)




<pre><code>Plan: 8 to add, 36 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.admin_name
  * azurerm_key_vault_secret.elastic_search_url_key_setting
  * azurerm_key_vault_secret.es_data_nodes_url
  * azurerm_key_vault_secret.password
  * terraform_data.vm[&#34;ccd-data-0&#34;]
  * terraform_data.vm[&#34;ccd-data-1&#34;]
  * terraform_data.vm[&#34;ccd-data-2&#34;]
  * terraform_data.vm[&#34;ccd-data-3&#34;]
* Update
  * azurerm_application_security_group.this
  * azurerm_lb.this[&#34;sandbox&#34;]
  * azurerm_network_security_group.nsg_group
  * azurerm_resource_group.this
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_network_interface.vm_nic
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_virtual_machine_extension.entra[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_network_interface.vm_nic
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_virtual_machine_extension.entra[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_network_interface.vm_nic
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_virtual_machine_extension.entra[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_network_interface.vm_nic
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_virtual_machine_extension.entra[0]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_security_group.this will be updated in-place
  ~ resource "azurerm_application_security_group" "this" {
        id                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg"
        name                = "ccd-data-asg"
      ~ tags                = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "sandbox" -> null
          - "expiresAfter" = "3000-01-01" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.admin_name will be created
  + resource "azurerm_key_vault_secret" "admin_name" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-shared-sandbox/providers/Microsoft.KeyVault/vaults/ccd-sandbox"
      + name                    = "ccd-vm-admin-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.elastic_search_url_key_setting will be created
  + resource "azurerm_key_vault_secret" "elastic_search_url_key_setting" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-shared-sandbox/providers/Microsoft.KeyVault/vaults/ccd-sandbox"
      + name                    = "ccd-ELASTIC-SEARCH-URL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.es_data_nodes_url will be created
  + resource "azurerm_key_vault_secret" "es_data_nodes_url" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-shared-sandbox/providers/Microsoft.KeyVault/vaults/ccd-sandbox"
      + name                    = "ccd-ELASTIC-SEARCH-DATA-NODES-URL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.password will be created
  + resource "azurerm_key_vault_secret" "password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-shared-sandbox/providers/Microsoft.KeyVault/vaults/ccd-sandbox"
      + name                    = "ccd-vm-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_lb.this["sandbox"] will be updated in-place
  ~ resource "azurerm_lb" "this" {
        id                   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Network/loadBalancers/ccd-internal-sandbox-lb"
        name                 = "ccd-internal-sandbox-lb"
      ~ tags                 = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "sandbox" -> null
          - "expiresAfter" = "3000-01-01" -> null
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_security_group.nsg_group will be updated in-place
  ~ resource "azurerm_network_security_group" "nsg_group" {
        id                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg"
        name                = "ccd-cluster-nsg"
      ~ tags                = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_resource_group.this will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox"
        name       = "ccd-elastic-search-sandbox"
      ~ tags       = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # terraform_data.vm["ccd-data-0"] will be created
  + resource "terraform_data" "vm" {
      + id               = (known after apply)
      + triggers_replace = [
          + "64b08ef0e12825b3eb14a1aa0502a416",
          + "3aa9aa20613862ad8139d679c6e20b94",
          + "136ca3d0c8960b3050fc2287dd349283",
          + "1f9c7e6d9906f7c0e69225023a8a747c",
        ]
    }

  # terraform_data.vm["ccd-data-1"] will be created
  + resource "terraform_data" "vm" {
      + id               = (known after apply)
      + triggers_replace = [
          + "64b08ef0e12825b3eb14a1aa0502a416",
          + "3aa9aa20613862ad8139d679c6e20b94",
          + "136ca3d0c8960b3050fc2287dd349283",
          + "1f9c7e6d9906f7c0e69225023a8a747c",
        ]
    }

  # terraform_data.vm["ccd-data-2"] will be created
  + resource "terraform_data" "vm" {
      + id               = (known after apply)
      + triggers_replace = [
          + "64b08ef0e12825b3eb14a1aa0502a416",
          + "3aa9aa20613862ad8139d679c6e20b94",
          + "136ca3d0c8960b3050fc2287dd349283",
          + "1f9c7e6d9906f7c0e69225023a8a747c",
        ]
    }

  # terraform_data.vm["ccd-data-3"] will be created
  + resource "terraform_data" "vm" {
      + id               = (known after apply)
      + triggers_replace = [
          + "64b08ef0e12825b3eb14a1aa0502a416",
          + "3aa9aa20613862ad8139d679c6e20b94",
          + "136ca3d0c8960b3050fc2287dd349283",
          + "1f9c7e6d9906f7c0e69225023a8a747c",
        ]
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "linvm" {
        id                                                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-0"
        name                                                   = "ccd-data-0"
      ~ tags                                                   = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (40 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk1"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/disks/ccd-data-0-datadisk1"
        name                              = "ccd-data-0-datadisk1"
      ~ tags                              = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (30 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk2"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/disks/ccd-data-0-datadisk2"
        name                              = "ccd-data-0-datadisk2"
      ~ tags                              = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (30 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Network/networkInterfaces/ccd-data-0-nic"
        name                           = "ccd-data-0-nic"
      ~ tags                           = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_virtual_machine_extension.entra[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "entra" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-0/extensions/AADSSHLoginForLinux"
        name                        = "AADSSHLoginForLinux"
      ~ tags                        = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "sandbox" -> null
          - "expiresAfter" = "3000-01-01" -> null
        }
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "linvm" {
        id                                                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-1"
        name                                                   = "ccd-data-1"
      ~ tags                                                   = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (40 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk1"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/disks/ccd-data-1-datadisk1"
        name                              = "ccd-data-1-datadisk1"
      ~ tags                              = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (31 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk2"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/disks/ccd-data-1-datadisk2"
        name                              = "ccd-data-1-datadisk2"
      ~ tags                              = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (31 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Network/networkInterfaces/ccd-data-1-nic"
        name                           = "ccd-data-1-nic"
      ~ tags                           = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_virtual_machine_extension.entra[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "entra" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-1/extensions/AADSSHLoginForLinux"
        name                        = "AADSSHLoginForLinux"
      ~ tags                        = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "sandbox" -> null
          - "expiresAfter" = "3000-01-01" -> null
        }
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "linvm" {
        id                                                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-2"
        name                                                   = "ccd-data-2"
      ~ tags                                                   = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (40 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk1"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/disks/ccd-data-2-datadisk1"
        name                              = "ccd-data-2-datadisk1"
      ~ tags                              = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (31 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk2"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/disks/ccd-data-2-datadisk2"
        name                              = "ccd-data-2-datadisk2"
      ~ tags                              = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (31 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Network/networkInterfaces/ccd-data-2-nic"
        name                           = "ccd-data-2-nic"
      ~ tags                           = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_virtual_machine_extension.entra[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "entra" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-2/extensions/AADSSHLoginForLinux"
        name                        = "AADSSHLoginForLinux"
      ~ tags                        = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "sandbox" -> null
          - "expiresAfter" = "3000-01-01" -> null
        }
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "linvm" {
        id                                                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-3"
        name                                                   = "ccd-data-3"
      ~ tags                                                   = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (40 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk1"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/disks/ccd-data-3-datadisk1"
        name                              = "ccd-data-3-datadisk1"
      ~ tags                              = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (31 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk2"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/disks/ccd-data-3-datadisk2"
        name                              = "ccd-data-3-datadisk2"
      ~ tags                              = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (31 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Network/networkInterfaces/ccd-data-3-nic"
        name                           = "ccd-data-3-nic"
      ~ tags                           = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_virtual_machine_extension.entra[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "entra" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-3/extensions/AADSSHLoginForLinux"
        name                        = "AADSSHLoginForLinux"
      ~ tags                        = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "sandbox" -> null
          - "expiresAfter" = "3000-01-01" -> null
        }
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "azure_monitor" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-0/extensions/AMALinux"
        name                        = "AMALinux"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-0/extensions/HMCTSBootstrapScript"
        name                        = "HMCTSBootstrapScript"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-0/extensions/Dynatrace"
        name                        = "Dynatrace"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "azure_monitor" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-1/extensions/AMALinux"
        name                        = "AMALinux"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-1/extensions/HMCTSBootstrapScript"
        name                        = "HMCTSBootstrapScript"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-1/extensions/Dynatrace"
        name                        = "Dynatrace"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "azure_monitor" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-2/extensions/AMALinux"
        name                        = "AMALinux"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-2/extensions/HMCTSBootstrapScript"
        name                        = "HMCTSBootstrapScript"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-2/extensions/Dynatrace"
        name                        = "Dynatrace"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "azure_monitor" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-3/extensions/AMALinux"
        name                        = "AMALinux"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-3/extensions/HMCTSBootstrapScript"
        name                        = "HMCTSBootstrapScript"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
        id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-elastic-search-sandbox/providers/Microsoft.Compute/virtualMachines/ccd-data-3/extensions/Dynatrace"
        name                        = "Dynatrace"
      ~ tags                        = {
          - "application"  = "core-case-data"
          - "builtFrom"    = "github.com/hmcts/ccd-module-elastic-search"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 8 to add, 36 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label sandbox/add-or-update: POST https://api.github.com/repos/hmcts/ccd-elastic-search/issues/135/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":135,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->